
/* Обычный тестовый файл, где я эксперементирую. Нахожу в интренете или придумываю себе сам какую нить задачу и пытаюсь реализовать ее путем имеющихся у меня знаний и опыта.
Разделено все звездочками ( ******** )). Нужное раскоментировать и запустить. Все просто. */



/*  **************************************************************************************************************************************************************** */

/*  **************************************************************************************************************************************************************** */


/* 
let budget = +prompt("Ваш бюджет за месяц?");
let date = prompt("Введите дату в формате YYYY-MM-DD");
//console.log(budget);
//console.log(date);
let questionOne = prompt("Введите обязательную  сумму расходов в этом месяце"); // я так понял сколько надо купить
let questionTwo = prompt("Во сколько обойдется"); // видимо стоимость покупки

let appData = {
    Budget: (budget - questionTwo) / 30,
    timeData: date,
    expenses: { 
        QuestionOne: 'Ответ на первый вопрос ' + questionOne,
        QuestionTwo: 'Ответ на второй вопрос ' + questionTwo, 
    },
    optionalExpenses: {},
    income: [],
    savings: false,
    
};

//console.log(appData);
alert("Ваш бюджет на 1 день составляет у/е " + appData.Budget); */ 

//Код выше личный код, но по курсу он не подходит(( Обидно конечно.


/*  **************************************************************************************************************************************************************** */
/*  **************************************************************************************************************************************************************** */

/* Программа по видео курсу
 */

/* let money = +prompt("Ваш бюджет на месяц?", ''),
    time = prompt ("Введите дату", '');

let appData = {
    budget:money,
    expenses: {},
    optionalExpenses: {},
    income: [],
    timeData: time,
    saving: false
} */

/* for (let i = 0; i < 2; i++) {
    let a = prompt ("Введите обязательную статью расходов в этом месяце", ''),
        b = prompt ("Во сколько обойдется?", '');
    if ( (typeof(a))==='string' && ( typeof(a)) != null && ( typeof(b)) != null
        && a != '' && b !='' && a.length < 50 ) {
        console.log("done");
        appData.expenses[a] = b;
    } else {
        // записать  чтобы вернуться к вопросу заново ге то на 5 минутах 9 урока
    }
 }; */

/*  appData.moneyPerDay = (appData.budget / 30);

 alert("Ежедневный бюджет: " + appData.moneyPerDay);

if(appData.moneyPerDay < 100) {
    console.log("Минимальный уровень достатка");
} else if(appData.moneyPerDay > 100 && appData.money < 2000) {
    console.log("Средний уровень достатка");
} else if (appData.moneyPerDay > 2000) {
    console.log("Высокий уровень достатка");
} else {
    console.log("Произошла ошибка");
} */

 
/* **************************************************************************************************************************************************************** */
/* **************************************************************************************************************************************************************** */

                          /* 12.02.2020 */
                    /* Пробую условие If и Else*/



/* let questionOne = prompt ("Кто здесь?");

if (questionOne == "Я здесь главный"){
    alert("Добрый день");
    
} else if (questionOne == "Админ"){
    
    let questionTwo = prompt ("Пароль?")
    if (questionTwo == ("Я здесь главный")){
        alert("Ну привет!");
    } else if (questionTwo == ''){
        alert("=_= \n Ты ничего не ввел");
    } else if(questionTwo == null){
        alert("Ты нажал ESC. \n Дурак чтоль?");
    } else {
        alert ("Пароль не верный");
    } 


} else if (questionOne == null){
    alert ("Вы нажали ESC")
} else if (questionOne == ''){
    alert(" =_= \n Это что? Пустая строка? ")
}
else {
    alert("Я вас не знаю, идите лесом");
} */

/* **************************************************************************************************************************************************************** */
/* **************************************************************************************************************************************************************** */


                                               /* 13.02.2020
                                    Снова импровизирую с if и  else */

/* let questionOne = prompt (" Привет поиграем в игру? \n Да или Нет");

if (questionOne == "Да") {

    let questionTwo = prompt ("Отлично! \n Сколько тебе лет?")
    if (questionTwo < 10) {
        alert (" Что то маловато, с тобой будет не интересно")
    } else if (questionTwo <= 10) {
        alert ("Нормальный такой возраст, но мне все равно с тобой будет не интересно")
    } else if (questionTwo >= 18) {


        let questionThree = prompt ("Это хороший возраст! \n Ты пьешь? \n Да или Нет")
        if (questionThree == "Да") {
            alert ("А я вот не пью и тебе не советую")
        } else if (questionThree == "Нет"){
            alert ("Здорово! Я тоже. На этом пока и закончим")
        }
    }
} else if (questionOne == "Нет"){
    alert("Как хочешь")
} */

/* **************************************************************************************************************************************************************** */
/* **************************************************************************************************************************************************************** */

/* Самостоятельная попытка сделать задание с learnJava */


/* let userName = prompt("Кто здесь?", '');

if (userName == "Админ") {

    let pass = prompt ("Пароль?",'');

    if (pass == "Я Главный"){
        alert ("Доброго времени суток");
    } else if ( pass == '' || pass == null){
        alert ("Отменено");
    } else {
        alert( "Неверный пароль");
    }


} else if (userName == '' || userName == null){
    alert ("Отменено");
} else {
    alert ("Я вас не знаю");
} */

/* **************************************************************************************************************************************************************** */
/* **************************************************************************************************************************************************************** */



/* let word = +prompt (" введите число 2 ");

while (word !== 2 || word == null || word == ''){
    alert("Не сработало");
    let word = +prompt ("введите число 2");
    if (word == 2) break;
    
  
}
alert ("Сработало"); */
 

/* let word = +prompt ("Введите число 1");

do {
    alert ("Не сработало");
    let word = +prompt("Введите число  1");
    if (word == 1) break;
} while (word !== 1 || word == null || word == '');
alert ("Сработало"); */

/* let browser = prompt ("Название браузера на анг");
if (browser == 'edge'){
    alert ("You've got the Edge!");
} else if (browser == 'Chrome'
    || browser == 'Firefox'
    || browser == 'Safari'
    || browser == 'Opera') {
        alert ("Okay.")
    } else {
        alert(" Bup");
    } */

    const number = +prompt('Введите число между 0 и 3', '');

    switch (number){
    
        /* case 0:
            alert('Вы ввели число 0');
            break; */
        case 1:
            alert('Вы ввели число 1');
            break;
        case 3:
        case 2:
            alert('Вы ввели число 2 или 3');
            break;
        default:
            if (number == '' || number == null){
                alert("Вы ничего не ввели");
            } else {
                alert("число больше запрошенного");
            }
    }